{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 3, 3], "name": "input_1", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 3, 3], "name": "input_2", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["input_1", 0, 0], ["input_2", 0, 0]]], "name": "merge_1"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["merge_1", 0, 0]], "name": "model_1"}}