{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 3, 3], "name": "input_1", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "epsilon": 1e-06, "trainable": true, "mode": 0, "momentum": 0.1, "axis": 1}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "batchnormalization_1"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["batchnormalization_1", 0, 0]], "name": "model_1"}}