{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 4, 4], "name": "input", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 3, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["input", 0, 0]]], "name": "convolution2d_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "activation_1"}], "input_layers": [["input", 0, 0]], "output_layers": [["activation_1", 0, 0]], "name": "model_2"}}